Revit 2017 API
IDockablePaneProvider Interface
 Interface that the Revit UI will call during initialization of the user interface to gather information about add-in dockable pane windows.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public interface IDockablePaneProvider
Visual Basic
Public Interface IDockablePaneProvider
Visual C++
public interface class IDockablePaneProvider
See Also
IDockablePaneProvider Members
Autodesk.Revit.UI Namespace